spec/support/vcr_cassettes/emis/get_military_service_episodes/invalid.yml

---
http_interactions:
- request:
    method: post
    uri: https://vaausvrsapp81.aac.va.gov/VIERSService/eMIS/v1/MilitaryInformationService
    body:
      encoding: ASCII-8BIT
      string: |2

        <soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://viers.va.gov/cdi/CDI/commonService/v1" xmlns:v12="http://viers.va.gov/cdi/eMIS/RequestResponse/v1" xmlns:v13="http://viers.va.gov/cdi/eMIS/commonService/v1" xmlns:v11="http://viers.va.gov/cdi/eMIS/RequestResponse/MilitaryInfo/v1">
          <soap:Header>
            <v1:inputHeaderInfo>
              <v1:userId>vets.gov</v1:userId>
              <v1:sourceSystemName>vets.gov</v1:sourceSystemName>
              <v1:transactionId>245e2072-c7a6-48f0-a429-549355af5cf9</v1:transactionId>
            </v1:inputHeaderInfo>
          </soap:Header>
          <soap:Body>
            <v11:eMISserviceEpisodeRequest>
              <v12:edipiORicn>
                <v13:edipiORicnValue>1607472595</v13:edipiORicnValue>
                <v13:inputType>EDIPI</v13:inputType>
              </v12:edipiORicn>
            </v11:eMISserviceEpisodeRequest>
          </soap:Body>
        </soap:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - application/soap+xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - http://viers.va.gov/cdi/eMIS/getMilitaryServiceEpisodes/v1
      Date:
      - Wed, 19 Apr 2017 19:17:25 GMT
      Content-Length:
      - '949'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Apr 2017 19:17:20 GMT
      Server:
      - Apache/2.4.6 (Red Hat Enterprise Linux)
      Set-Cookie:
      - BlueStripe.PVN=8f78f81d00000028; path=/
      Content-Length:
      - '2970'
      Cache-Control:
      - max-age=0, no-store
      Connection:
      - close
      Content-Type:
      - application/soap+xml;charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?>
              <NS4:eMISdeploymentResponse xmlns:NS4="http://viers.va.gov/cdi/eMIS/RequestResponse/MilitaryInfo/v1">
                <NS5:ESSError xmlns:NS5="http://viers.va.gov/cdi/eMIS/RequestResponse/v1">
                  <NS4:essTransactionID xmlns:NS4="http://viers.va.gov/cdi/CDI/commonService/v1">f834fbfa-f571-4efc-b724-829ddbccbae1</NS4:essTransactionID>
                  <NS5:ESSResponseCode xmlns:NS5="http://viers.va.gov/cdi/CDI/commonService/v1">ERROR</NS5:ESSResponseCode>
                  <NS6:code xmlns:NS6="http://viers.va.gov/cdi/CDI/commonService/v1">MIS-ERR-003</NS6:code>
                  <NS7:text xmlns:NS7="http://viers.va.gov/cdi/CDI/commonService/v1">INVALID_IDENTIFIER</NS7:text>
                  <NS8:essCode xmlns:NS8="http://viers.va.gov/cdi/CDI/commonService/v1">gov.va.ess.fault.io.InputOutputFault</NS8:essCode>
                  <NS9:essText xmlns:NS9="http://viers.va.gov/cdi/CDI/commonService/v1">EDIPI incorrectly formatted</NS9:essText>
                  <NS10:severity xmlns:NS10="http://viers.va.gov/cdi/CDI/commonService/v1">Error</NS10:severity>
                  <NS11:timestamp xmlns:NS11="http://viers.va.gov/cdi/CDI/commonService/v1">2017-04-19T14:19:32.823174-05:00</NS11:timestamp>
                  <NS12:serviceName xmlns:NS12="http://viers.va.gov/cdi/CDI/commonService/v1">Veteran Eligibility</NS12:serviceName>
                  <NS13:userId xmlns:NS13="http://viers.va.gov/cdi/CDI/commonService/v1">vets.gov</NS13:userId>
                  <NS14:codePackage xmlns:NS14="http://viers.va.gov/cdi/CDI/commonService/v1">gov.va.viers.emis.milinfo</NS14:codePackage>
                  <NS15:serviceDomain xmlns:NS15="http://viers.va.gov/cdi/CDI/commonService/v1">Military History</NS15:serviceDomain>
                  <NS16:businessDomain xmlns:NS16="http://viers.va.gov/cdi/CDI/commonService/v1">Enterprise Military Information</NS16:businessDomain>
                </NS5:ESSError>
              </NS4:eMISdeploymentResponse>
      http_version:
  recorded_at: Wed, 19 Apr 2017 19:17:26 GMT
recorded_with: VCR 3.0.3
